In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
engine = create_engine("postgres://postgres:9507024922@localhost/Airlines")

**QUESTION** 1: List the Cities in which there is no flight from Moscow

In [36]:
query = "Select distinct(city ->> 'en') as city \
	from airports \
	where (city ->> 'en') <> 'Moscow' \
	order by city" 

df = pd.read_sql_query(query, con = engine)
df.head(10)

             city
0          Abakan
1          Anadyr
2           Anapa
3     Arkhangelsk
4       Astrakhan
5         Barnaul
6        Belgorod
7      Beloyarsky
8          Beslan
9  Blagoveschensk

**QUESTION2** Select Airports where the time zone is in Asia/Novokuznetsk and Asia/Krasnoyark

In [16]:
query = "select (airport_name ->> 'en') as airport_name \
	from airports \
	where timezone  in  ('Asia/Novokuznetsk','Asia/Krasnoyarsk')" 

df = pd.read_sql_query(query, con = engine)
df.head(10)

             airport_name
0        Kemerovo Airport
1       Bogashevo Airport
2  Norilsk-Alykel Airport
3     Yemelyanovo Airport
4           Kyzyl Airport
5     Spichenkovo Airport
6      Strezhevoy Airport
7   Gorno-Altaysk Airport
8          Abakan Airport
9         Barnaul Airport

**QUESTION 3**  Get Model, range, and miles of every aircraft that exists in the airlines Database, notice that 
miles = range/1.609 and round the result to 2 numbers after the float point

In [20]:
query = "select (model  ->> 'en') as model, range, round((range/1.609), 2) as Miles \
          from aircrafts " 

df = pd.read_sql_query(query, con = engine)
df.head(10)

                 model  range    miles
0       Boeing 777-300  11100  6898.69
1       Boeing 767-300   7900  4909.88
2  Sukhoi Superjet-100   3000  1864.51
3      Airbus A320-200   5700  3542.57
4      Airbus A321-200   5600  3480.42
5      Airbus A319-100   6700  4164.08
6       Boeing 737-300   4200  2610.32
7   Cessna 208 Caravan   1200   745.80
8   Bombardier CRJ-200   2700  1678.06

**QUESTION 4** : Return all information about aircraft that has aircraft_code SU9 and its range in miles

In [35]:
query = "Select aircraft_code, (model ->> 'en') as model,  round((range/1.609), 2) as Miles \
	from aircrafts \
	where aircraft_code = 'SU9'" 

df = pd.read_sql_query(query, con = engine)
df.head(10)

  aircraft_code                model    miles
0           SU9  Sukhoi Superjet-100  1864.51

**QUESTION 5** : Calculate the Average Tickets Sales

In [ ]:
query = "Select avg(amount) from ticket_flights'" 

df = pd.read_sql_query(query, con = engine)
df.head(10)